Revit 2024 API
MEPSection.GetPressureDrop Method
 Gets the pressure drop for the specified element id in this section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double GetPressureDrop(
	ElementId elemId
)
Visual Basic
Public Function GetPressureDrop ( _
	elemId As ElementId _
) As Double
Visual C++
public:
double GetPressureDrop(
	ElementId^ elemId
)
Parameters
elemId
Type: Autodesk.Revit.DB.ElementId
 The element id which can be duct segment, duct fitting , pipe segment and pipe fitting.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The ElementId elemId does not correspond to a valid section member.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace